import { useContext, useState } from "react";
import { debug } from "../assets/function/functions";
import { User } from "..";
import Carousel from "react-multi-carousel";
import Card from "../components/Card";
import { responsive } from "./Home";
import './About.css';

const aboutDict = {
    item1: {
        title: <h3>למה זה חשוב ?</h3>,
        body: <p><b>התשובה הראשונה – התשובה הפרקטית:</b>
            מכיוון שסטטיסטית , תלמידי 5 יחידות מתמטיקה מקבלים תפקידים טובים ומעניינים יותר במשק מאשר תלמידי 4 או 3 יחידות מתמטיקה.


            מכיוון שהשכר הממוצע של תלמידי 5 יחידות מתמטיקה גבוה ה 41% מתלמידים שאינם בעלי 5 יחידות.

            ואם בעניין השכר – אז אנחנו יודעים ,כי לצערנו , יש חוסר שוויון בין הגברים לנשים בנושא השכר.

            אחת הדרכים העיקריות להגיע לתפקידים שוויוניים מבחינת הנשים , היא להיות בוגרות 5 יחידות מתמטיקה, כי אז הן מגיעות לתפקידים שבהם השכר

            שלהן אינו שונה מהגברים באותו התפקיד.<br />

            <b> התשובה השנייה – התשובה הפילוסופית:</b>

            מתמטיקה היא השפה שבה אנו , בני האדם מתארים את המציאות סביבנו.  את הטבע (פיזיקה) , כימיה , ביולוגיה

            והיא השפה שבעזרתה אנו בונים את העולם הטכנולוגי שאנחנו כל כך תלויים בו , לכן זו השפה גם של המהנדסים.

            מכאן , כל מי שרוצה להיות חלק מהעולם הזה, עולם המדע או העולם הטכנולוגי , חייב לא רק לדעת מתמטיקה , אלא גם לאהוב אותה ,

            לאהוב אותה מכיוון שהיא היסוד שעליו אנחנו מבססים את ההתקדמות האנושית.</p>
    },
    item2: {
        title: <h3>למה זה חשוב ?</h3>,
        body: <p><b>התשובה הראשונה – התשובה הפרקטית:</b>
            מכיוון שסטטיסטית , תלמידי 5 יחידות מתמטיקה מקבלים תפקידים טובים ומעניינים יותר במשק מאשר תלמידי 4 או 3 יחידות מתמטיקה.


            מכיוון שהשכר הממוצע של תלמידי 5 יחידות מתמטיקה גבוה ה 41% מתלמידים שאינם בעלי 5 יחידות.

            ואם בעניין השכר – אז אנחנו יודעים ,כי לצערנו , יש חוסר שוויון בין הגברים לנשים בנושא השכר.

            אחת הדרכים העיקריות להגיע לתפקידים שוויוניים מבחינת הנשים , היא להיות בוגרות 5 יחידות מתמטיקה, כי אז הן מגיעות לתפקידים שבהם השכר

            שלהן אינו שונה מהגברים באותו התפקיד.<br />

            <b> התשובה השנייה – התשובה הפילוסופית:</b>

            ככה אנחנו בונים אבני יסוד חזקות: הבנה תיאורטית מוחשית וטובה, ואז אנחנו כבר לא זקוקים לשיטה של תרגיל ועוד תרגיל ועוד תרגיל… קחו אנלוגיה: צייר טוב יודע לערבב מ 3 צבעי יסוד את כל הצבעים שהעין מסוגלת לקלוט. צייר שלא מודע לערבובים ולוריאציות צריך לקנות המון המון צבעים כדי לתאר את המציאות על הבד. אז בפעם הבאה שאתם נתקלים בקורס שמתהדר בכמה הוא ארוך ומלא תרגול.</p>
    },
    item4: {
        img: undefined,
        title: <h3>מה הרציונל שלנו?</h3>,
        promot: <p>מי אנחנו?
            ולמה הקורס שלנו טוב יותר</p>,
        body: <p>לפני שאתם מתחילים ללמוד מתמטיקה איתי,
            אני בטוח שיש לכם המון שאלות
            למה ללמוד כאן ?
            כמה אני צריך להשקיע כדי להצליח בבגרות ?
            איך לומדים כאן ?
            איך אני צריך להרגיש כשאני לומד ?
            מי המורה שלי ?
            אז…נתחיל לאט לאט ?ואולי נתחיל מהסוף

            קוראים לי שי , שי חכימי , ואני מלמד מתמטיקה ופיזיקה ברמת 5 יחידות לבגרות החל משנת 2001
            אבל אם אגיד 19 שנה, בעוד שנה זה לא יהיה רלוונטי
            …איך הפכתי למורה למתמטיקה ופיזיקה… ?


            זה סיפור די מעניין וקצת מוזר , אז , אני מבטיח שאספר לכם בסרט אחר , למי שרוצה מוטיבציה ללמידה , ואולי להבין מה המתמטיקה מסוגלת לעשות לנו.
            נחזור לשאלה : למה ללמוד כאן ?
            היום יש שני סוגי למידה עיקריים:
            למידה בכיתה , מולי עומד מורה – ואפילו מורה מעולה , אבל…אני מחויב להגיע לכיתה , כשנוח וכשלא נוח לי , חולה , או בריא , מצוברח או שמח.
            אתם יודעים מה … תהליך למידה הוא תהליך כל כך אינטימי ועדין , שאי אפשר להכריח להירתם לו בשעות קבועות , ולא תמיד בא לי להיות מרוכז למפגשים ארוכים של כמה שעות, ואם אני רוצה לשמוע את ההסבר שוב ? הרי בתהליך למידה נכון , אני לא אמור לשמוע הסבר ומייד להבין אותו ב 100% , ועל זה מסתמכים בלמידה פרונטלית , “הסברתי לך כרגע , בוא ותתרגל” , מה פתאום !!! כבר אמרתי לכם שתהליך למידה הוא לא תהליך מכאני , לפעמים אני צריך הפסקה לעבד נתונים , לפעמים אני רוצה לשמוע שוב את ההסבר כי פיספסתי מילה אחת או שתיים , למה להגביל את טבע הלמידה הנכון כי בימי הביניים המציאו את המסגרת הכיתתית (אכן , בתקופת ימי הביניים , למידה היתה מורה מול כיתה , לפני כן הלמידה היתה מורה-אומן מול תלמיד-מתמחה) וזה רק העניין הפרטי מה בנוגע לזה שסביבי יושבים עכשיו בממוצע 30 או 40 תלמידים. לא תמיד נוח לי לשאול עם כל כך הרבה תלמידים על הראש , או שאין תמיד את השקט שאני צריך כדי ללמוד.
            אתם משלמים מחיר מאוד מאוד יקר אני לא רוצה להיכנס לסכום , כי הוא מאוד משתנה ממכון למכון , וגם בתוך המכון. אם תלמיד לקח כמה קורסים , המחיר יכול לרדת ב 40% רובם משלמים דרך הפיקדון , והם לא רואים הזה כסף אמיתי , וכמובן שיש שונות בין המכונים השונים. והכי בעייתי , המכינות של המכללות – שם זה כמעט בחינם, אני לא התכוונתי רק למחיר הכספי , התכוונתי גם למחיר הכולל שעליו דיברנו : זמן , פקקים, נוחות…. כדי ללמוד מאותו המורה המעולה שנמצא מולכם , ואתם רוצים וצריכים את ההסבר שלו , לא בא לכם על קורס אינטרנטי קר שבו אין ממש הסבר עמוק , אין את האפשרות לשאול שאלות , אין למי לפנות. וזה מביא אותי לסוג הלמידה השני שקיים…
            קורסים מכוונים , ז”א קורסים באינטרנט. שם אנחנו פותרים את כל הבעיות של המיקום, פקקים, כיתות גדולות, יש לי חשק היום , אין לי חשק היום… אבל , מה המחיר ? גם כאן לא התכוונתי למחיר כספי , אולי יש לך מילה אחרת ? בדרך כלל אלה קורסים טכניים מאוד , ללא הסברי עומק , ואתם יודעים מה…אין ממש מישהו שמדבר אלי , אני לא מרגיש שהמורה הוא באמת מורה שלי. במקרה אחד , השיעור הוא צילום של שיעור בכיתה , ובמקרה אחר , מדבר אלי קול דרך המחשב. מי יכול להתחבר לסתם קול שמדבר דרך המחשב ? מי יכול לבצע פעולה כל כך עדינה ואינטימית על ידי הסבר קר בכתב יד.
            אז… מה אני מציע ?
            בואו ונשלב את הטוב שבשתי השיטות
            הקורס הוא קורס אינטרנטי , ולכן משחרר אתכם מפקקים , זמן מבוזבז , שעות לא נוחות , רעש , חוסר באינטימיות , התמודדות עם תלמידים נוספים.
            אבל…זה קורס שמוקלט בבית , ברוגע ,עם המון המון נסיון וזמן חשיבה של – איך להפוך כל הרצאה וכל פתרון למדוייק מאוד כך שלא אבזבז לכם את הזמן עם פתרון לא מדוייק. , הקורס נכתב במחשב , כדי שתבינו כל פסיק ו…כדי שאוכל לדייק בכל פסיק במהלך הפתרון, לא רק הדיוק , גם השונות המטורפת שיש לי דרך המחשב – צבעים, הדגשות, מסגרות, המון אנימציות שאי אפשר להראות על לוח רגיל בכיתה. קורס שבו אתה רואה ומכיר את המורה שמלמד אותך, אתם מכירים אותי , את הפרצוף המכוער שלי , בטח תבלו איתי לפחות כמו הזמן שאתם מבלים עם הבני/בנות זוג שלכם. ההסברים שאתה מקבל הם לא רק הסברים טכניים , אלא עם משמעות פילוסופית והסתכלות על היישומים בעולם הפיזיקה של אותם כלים מתמטיים שעליהם אנחנו לומדים. אפשרות לשאול שאלות. ואני מדגיש – יש לכם את האפשרות לשאול שאלות, לקבל תשובות ואפילו לשמוע את השאלות והתשובות של תלמידים אחרים שמשתתפים איתכם בקורס.
            ממש לא הייתי פותח איתם ערוץ של וואטצאפ

            נמשיך לשאלה הבאה: ‘ כמה אני צריך להשקיע כדי להצליח בבגרות ? ‘
            אני בטוח שראיתם ספר מתמטיקה לבגרות.
            מה אתם זוכרים ממנו ? 700 עמודים , ומה שמפתיע , זה שהוא רק אחד מתוך כמה ספרים.
            מה ????
            באמת יש כל כך הרבה חומר ?
            באמת צריך לפתור כל כך הרבה תרגילים ?
            מה זה הטירוף הזה ? מתי נפתחה התחרות ‘למי יש יותר גדול’ סימנת את המשפט ‘למי יש יותר גדול’ אבל לא אמרת על זה כלום בסרטון. זה גס מידי ? בין ספרי המתמטיקה ?
            אני חושב שמישהו שכח את האמרה ‘מרוב עצים לא רועים את היער’ (ובאמת , המון עצים צריך בשביל כמות הספרים הללו)
            האם אני באמת צריך לפתור כל כך הרבה תרגילים ?
            בספרים האלה יש אלפים רבים של תרגילים , באמת צריך לפתור אלפי תרגילים ? אני עשיתי באוניברסיטה תואר בפיזיקה – זה לא מדעי הדשה , נכון ? , נראה לכם שפתרתי אלפי תרגילים בכל קורס ????? אולי בכל התואר פתרתי כמה מאות , מה חוסר ההגיון הזה ?
            אולי אני צריך לפתור כמות מסויימת של תרגילים בשביל להפנים את החומר,
            אבל לא צריך יותר משניים שלושה תרגילים בכל תת פרק כדי ללמוד נושא חדש,
            כי ברגע שאבני היסוד שלנו הן אבנים חזקות – ז”א ההבנה התיאורטית שלנו היא מוחשית וטובה , אנחנו כבר לא זקוקים לגישה הלא רלוונטית של תרגיל ועוד תרגיל ועוד תרגיל ……
            קחו אנלוגיה טובה :
            צייר טוב יודע לערבב מ 3 צבעי יסוד את כל הצבעים שהעין מסוגלת לקלוט , לכן צייר שהוא אומן , צריך מספר מאוד מצומצם של צבעים כדי לתאר יום מרהיב על הבד , צייר מתחיל שלא מודע לערבובים ולוריאציות השונות של שלושת הצבעים זקוק לקנות המון המון צבעים כדי לתאר את המציאות על הבד – תהיו ציירים טובים , אל תזדקקו ליותר מידי תרגילים כדי להבין את המציאות , תפנימו את הוריאציות שאפשר לקבל ממספר מועט של תרגילים
            אז בואו ונשאיר לרגע את התרגול האינסופי שהרגילו אתכם אליו בבית הספר ובקורסים השונים.
            בואו נלמד עם דוגמאות מעטות ומדויקות את המתמטיקה , ובסוף , נתרגל עם שאלות הבגרות עצמן ונראה איך שלא צריך יותר מידי תרגול באמצע הלמידה , מה שחשוב זה שנכיר את השפה, האופי וההיסטוריה של זה שבוחן אותנו , נכון ? איך נוכל לעשות זאת ? על ידי התמקדות בשאלות הבגרות של השנים האחרונות.
            ו…אם תרצו עוד תרגול , אחרי הלמידה שלנו כאן , תוכלו ללכת לספרים ולתרגל כמה שרק בא לכם. – חותך את המשפט הזה, מסכים איתך.
            אני חוסך לכם בזמן על ידי כך שאנחנו לא צריכים לפתור מאות תרגילים שרובם מיותרים.
            חוסך לכם בזמן על ידי כך שאני לא מביא אתכם לשבת בכיתה ולשרוף זמן בדרכים וזמן בכיתה שאפשר לדייק את הלימוד מכאן.
            למה כל כך חשוב לי לחסוך לכם בזמן ?
            כי ככה לומדים היום.
            יש לכם כל כך הרבה ללמוד , אם ‘תשרפו’ חצי שנה על תרגול אינסופי….מתי יהיה לכם זמן ללמוד עוד כדי לשנות את העולם ?
            אני חושב שלגבי שאר השאלות :
            איך לומדים כאן ?
            איך אני צריך להרגיש כשאני לומד ?
            מי המורה שלי ?
            לכולן יש חשיבות אם אנחנו מתכוונים לשבת יחד , אז נקדיש לכל אחת מהן שיחה נפרדת.</p>
    },
    item5: {
        img: undefined,
        title: <h3>האם תרגול שווה הצלחה?</h3>,
        promot: <p>מתמטיקה לא דורשת המון תרגול,
            ועוד סודות שלא יגלו לכם בבי״ס  </p>,
        body: <p>700 עמודים, ומה שמפתיע, זה שהוא רק אחד מתוך כמה ספרים. מה?! באמת יש כל כך הרבה חומר? באמת צריך לפתור כל כך הרבה תרגילים? מה זה הטירוף הזה? בבית הספר מרגילים אותנו לתרגול אינסופי בתור שיטה להפנים את החומר. פה חשדתי 🙂 האמת היא שזאת לא דרך טובה ללמוד. הרעיון הוא לעבוד חכם ומדויק במקום לתרגל ולתרגל. למה הכוונה? 

            והיא השפה שבעזרתה אנו בונים את העולם הטכנולוגי שאנחנו כל כך תלויים בו , לכן זו השפה גם של המהנדסים.

            מכאן , כל מי שרוצה להיות חלק מהעולם הזה, עולם המדע או העולם הטכנולוגי , חייב לא רק לדעת מתמטיקה , אלא גם לאהוב אותה ,

            לאהוב אותה מכיוון שהיא היסוד שעליו אנחנו מבססים את ההתקדמות האנושית.</p>
    }
}

export default function AboutUs({ ...props }) {
    document.title = 'הסיפור שלנו';
    const user = useContext(User);
    debug('Context: ', user, true);

    let frame1 = <>
        {Array(5).fill(1).map((item, indx) => (
            <Card key={indx} >
                <h1>{item}</h1>
                <p>משהו</p>

            </Card>
        ))}
    </>

    let caruselSection1 = <>
        <Card
            className={` `}
            style={{ backgroundImage: 'linear-gradient( transparent, rgb(168 0 230 / 30%))' }}
            cardID={'frame2Card2'}>
            <>
                <div className='flex center ma3 darkBlue mt1 gap1'>
                    <FontAwesomeIcon
                        style={{ fontSize: '3em' }}
                        icon={faPersonCircleQuestion} className='' size='2xl' />
                    <FontAwesomeIcon
                        style={{ fontSize: '3em' }}
                        icon={faComments} className='' size='2xl' />
                </div>

                <div>
                    <h3 className='cardText'>יש עם מי לדבר</h3>
                </div>
                <hr id='horizLine' />
                <p >תוכלו לשאול שאלות ולהתייעץ עם המרצה ועם מורים אחרים, ניתן לפנות אלינו במגוון דרכים ולקבל מענה בהתאם לצורך</p>
                <div className='ma1 darkBlue gap1 flex around'>
                    <FontAwesomeIcon title='Whatsapp' icon={faWhatsapp} />
                    <FontAwesomeIcon title='טלפון' icon={faPhone} />
                    <FontAwesomeIcon title='אימייל' icon={faEnvelope} />
                    <FontAwesomeIcon title='שיתוף מסמכים' icon={faMailReply} />

                </div>
                <h3 id='textGradient'> ההצלחה שלכם חשובה לנו!</h3>
            </>
        </Card>
        <Card
            className={` `}
            style={{
                padding: width >= 900 ? '1.5%' : '',
                backgroundImage: 'linear-gradient(transparent, var(--themeColorAlpha))'
            }}
            cardID={'frame2Card2'}>
            <>
                <div className='flex center ma3 mt1 darkBlue gap1'>
                    <FontAwesomeIcon
                        style={{ fontSize: '3em' }}
                        icon={faPlay} className='' size='2xl' />
                    <FontAwesomeIcon
                        style={{ fontSize: '2.5em' }}
                        icon={faWandMagicSparkles} className='' size='2xl' />
                </div>

                <div>
                    <h3 className='cardText'>למידה דיגיטלית וחדשנית </h3>
                </div>
                <hr id='horizLine' />
                <p >תוכן ויזואלי ערוך תמציתי ומדויק, סרטונים ותרגילים ברמה גבוהה יחד עם ממשק דיגטלי וכלים שיעזרו לכם להבין כל נושא לעומק  </p>

                <h3 id='textGradient'> להבין מתמטיקה באופן אינטואיטיבי</h3>
            </>
        </Card>
        <Card
            className={` `}
            style={{ backgroundImage: 'linear-gradient(transparent, rgb(32 206 1 / 30%))' }}
            cardID={'frame2Card2'}>
            <>
                <div className='flex center ma3 mt1 darkBlue gap1'>
                    <FontAwesomeIcon
                        style={{ fontSize: '3em' }}
                        icon={faLocationDot} className='' size='2xl' />
                    <FontAwesomeIcon
                        style={{ fontSize: '3em' }}
                        icon={faWifi} className='' size='2xl' />
                </div>

                <div>
                    <h3 className='cardText'>ללמוד בכל זמן ומקום</h3>
                </div>
                <hr id='horizLine' />
                <p > בואו ללמוד בנוחות, בקצב וברמה שמתאימה לכם <br /> האתר מותאם לגלישה בקצב מהיר ונתמך ע"י רוב המכשירים</p>
                <div className='ma1 darkBlue gap1 flex around'>
                    <FontAwesomeIcon title='סמארטפון' icon={faMobileScreen} />
                    <FontAwesomeIcon title='מחשב נייד' icon={faLaptop} />
                    <FontAwesomeIcon title='מחשב נייח' icon={faDesktop} />
                </div>
                <h3 id='textGradient'> ללמוד מתי ואיפה שנוח לך</h3>
            </>
        </Card>
    </>


    let aboutCarusel = <section className='caruselDiv'>
        <Carousel
            swipeable={true}
            draggable={false}
            showDots={true}
            responsive={responsive}
            // ssr={true} // means to render carousel on server-side.
            infinite={true}
            // autoPlay={this.props.deviceType !== "mobile" ? true : false}
            // autoPlaySpeed={1000}
            keyBoardControl={true}
            // customTransition="all .5"
            // transitionDuration={1000}
            // partialVisbile={true}
            containerClass="carousel-container"
            removeArrowOnDeviceType={["tablet", "mobile"]}
            // deviceType={this.props.deviceType}
            dotListClass="custom-dot-list-style"
            itemClass="carousel-item-padding-40-px">
            <div className="flex center">
                {frame1}
            </div>
            <div className="flex center">
                {frame1}
            </div>
        </Carousel>
    </section>

    return (
        <div id='about' className={`${user.darkMode ? 'darkMode' : ''}`}>
            <h1> הקורס הדיגיטלי המתקדם ביותר ללימודי מתמטיקה אונליין</h1>
            <h3>ללמוד, להבין ולתרגל מתמטיקה ממורים מנוסים שיודעים בדיוק מה אתם צריכים</h3>
            {aboutCarusel}

        </div>
    )
}